project/app/Providers/AppServiceProvider.php

select count(*) as aggregate from `escrows` where `status` = 3
select count(*) as aggregate from `users` where `status` = 1 and `kyc_status` = 2
select count(*) as aggregate from `drivers` where `status` = 1 and `kyc_status` = 2
select count(*) as aggregate from `withdrawals` where `status` = 0
select count(*) as aggregate from `support_tickets` where `user_type` = 1 and `status` = 0 and exists (select * from `ticket_messages` where `support_tickets`.`id` = `ticket_messages`.`ticket_id`)
select count(*) as aggregate from `support_tickets` where `user_type` = 2 and `status` = 0 and exists (select * from `ticket_messages` where `support_tickets`.`id` = `ticket_messages`.`ticket_id`)
select count(*) as aggregate from `deposits` where `status` = 'pending'
---
    public function boot()
    {
        Paginator::useBootstrap();

        view()->composer('*',function($settings){
            $settings->with('gs', cache()->remember('generalsettings', now()->addDay(), function () {
                return Generalsetting::first();
            }));

        });

        view()->composer('admin.partials.sidebar', function ($view) {
            $view->with([
                'disputed'                =>  Escrow::whereStatus(3)->count(),
                'pending_user_kyc'        =>  User::whereStatus(1)->where('kyc_status',2)->count(),
                'pending_driver_kyc'    =>  Driver::whereStatus(1)->where('kyc_status',2)->count(),
                'pending_withdraw'        =>  Withdrawals::whereStatus(0)->count(),
                'pending_user_ticket'     =>  SupportTicket::where('user_type',1)->whereStatus(0)->whereHas('messages')->count(),
                'pending_driver_ticket' =>  SupportTicket::where('user_type',2)->whereStatus(0)->whereHas('messages')->count(),
                'pending_agent_ticket'    =>  SupportTicket::where('user_type',3)->whereStatus(0)->whereHas('messages')->count(),
                'pending_deposits'        =>  Deposit::where('status','pending')->count(),

            ]);
        });